app/views/ads/_form.html.erb

        <li>
          <%= site_ad.select :site_id, @sites.map {|a| [a.name, a.id]}, :prompt => t('.choose_site') %>
---
SELECT `sites`.* FROM `sites` WHERE (state_id = 3)