app/views/zones/_form.html.erb

SELECT `sites`.* FROM `sites` WHERE (state_id = 3)
---
    <td class="label"><%= f.label :site_id, t('.found_in') %></td>
    <td><%= f.select :site_id, @sites.map {|s| [s.name, s.id]}, :prompt => t('.choose_site'), :selected => params[:site_id].present? ? params[:site_id] : @zone.site_id %></td>