app/controllers/ads_controller.rb

  def show # TODO: Clean up.
    @ad = Ad.find(params[:id],
      :joins => "LEFT JOIN zones ON zones.id = ads.zone_id",
      :select => "ads.*, zones.name as zone_name")
---
SELECT `zones`.* FROM `zones` INNER JOIN `zone_ads` ON `zones`.id = `zone_ads`.zone_id WHERE ((`zone_ads`.ad_id = 1))

  def create
    @ad = Ad.new(params[:ad])
    @zone = Zone.find(@ad.zone_id)
---
SELECT `zones`.* FROM `zones` WHERE (`zones`.`id` = 3) LIMIT 1

  def update
    @ad = Ad.find(params[:id])
    @zone = Zone.find(@ad.zone_id)
---
SELECT `zones`.* FROM `zones` WHERE (`zones`.`id` = 3) LIMIT 1