app/controllers/connect_controller.rb

SELECT zones.name AS name, ads.ad_file_name AS ad_file_name, ads.target_url AS ad_target_url, ads.id AS ad_id FROM `zones` LEFT JOIN zone_ads ON zone_ads.zone_id = zones.id LEFT JOIN ads ON ads.id = zone_ads.ad_id WHERE (zones.uuid IN ('21b8460d','-bffe-47','5c-9034-','c749193c','0e06d800','8f39-688','f-46ae-a','fca-8f00','b9a9cafe'))
---
  def index
    @ad = Ad.find(:first,
      :joins => "LEFT JOIN zones ON zones.id = ads.zone_id",
      :conditions => ["zones.uuid = ?", params[:uuid]],
      :select => "zones.uuid, ads.*")