app/controllers/sites_controller.rb

SELECT `sites`.* FROM `sites` WHERE (state_id = 3)
---
  def index
    if current_user.is_admin?
      @sites = Site.all # TODO: Site.active olacak.
    else

SELECT `users`.* FROM `users` WHERE (state_id = 1)
---
  def new
    @site = Site.new
    @users = User.all # TODO: Status'e göre çağrılacak.
  end