app/controllers/sites_controller.rb

  def show
    @site = Site.find(params[:id])
---
SELECT `sites`.* FROM `sites` WHERE (`sites`.`id` = 1) LIMIT 1

  def create
    @site = Site.new(params[:site])
    unless @site.user_id and current_user.is_admin?
      @site.user_id = current_user.id
    end

    if @site.save
---
INSERT INTO `sites` (`created_at`, `name`, `status_id`, `updated_at`, `url`, `user_id`) VALUES ('2010-10-25 14:50:40', 'Soner Eker', NULL, '2010-10-25 14:50:40', 'http://sonereker.com', 1)

  def edit
    @site = Site.find(params[:id])
---
SELECT `sites`.* FROM `sites` WHERE (`sites`.`id` = 1) LIMIT 1

  def update
    @site = Site.find(params[:id])
    if @site.update_attributes(params[:site])
---
SELECT `sites`.* FROM `sites` WHERE (`sites`.`id` = 1) LIMIT 1
UPDATE `sites` SET `name` = 'Resesif', `updated_at` = '2010-10-26 07:06:48', `url` = 'http://resesif.com', `user_id` = 5 WHERE (`sites`.`id` = 1)