app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY created_at desc
---
  def index
    @users = User.all(:order => "created_at desc")

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO `users` (`company`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `firstname`, `is_admin`, `last_sign_in_at`, `last_sign_in_ip`, `lastname`, `password_salt`, `phone`, `remember_created_at`, `remember_me`, `remember_token`, `reset_password_token`, `sign_in_count`, `state_id`, `updated_at`) VALUES ('Resesif', '2010-10-26 09:14:05', NULL, NULL, 'soner@sonereker.com', '$2a$10$Fb6ECaOjcxc/y.CouUpbfeHHtUMQbVyokqbd2e4/uRdYLJ2YPEiC2', 'Soner', 1, NULL, NULL, 'Eker', '$2a$10$Fb6ECaOjcxc/y.CouUpbfe', '05079967952', NULL, NULL, NULL, NULL, 0, 1, '2010-10-26 09:14:05')
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def edit
    if current_user.is_admin?
      @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `company` = 'Yeni Hayat', `firstname` = 'Soner', `lastname` = 'Eker', `phone` = '05079967952', `updated_at` = '2010-10-25 12:38:25' WHERE (`users`.`id` = 2)
---
  def update
    if current_user.is_admin?
      @user = User.find(params[:id])
      @states = State.users
    else
      @user = current_user
    end

    if @user.update_attributes(params[:user])