app/controllers/zones_controller.rb

  def show # TODO: Clean up.
    @zone = Zone.find(params[:id],
      :joins => "LEFT JOIN sites ON sites.id = zones.site_id",
      :select => "zones.*, sites.name as site_name")
---
SELECT `sites`.* FROM `sites` WHERE (`sites`.`id` = 1) LIMIT 1
SELECT zones.*, sites.name AS site_name FROM `zones` INNER JOIN `sites` ON `sites`.`id` = `zones`.`site_id` WHERE (zones.id = '1')

  def new
    if Site.exists?(:user_id => current_user.id)
---
SELECT `sites`.`id` FROM `sites` WHERE (`sites`.`user_id` = 1) LIMIT 1

  def create
    @zone = Zone.new(params[:zone])
    unless @zone.user_id
      @zone.user_id = current_user.id
    end

    @site = Site.find(@zone.site_id)

    if @site
      @zone.user_id = @site.user_id
    end

    if @zone.save
---
SELECT `sites`.* FROM `sites` WHERE (`sites`.`id` = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
INSERT INTO `zones` (`created_at`, `cycle`, `height`, `name`, `site_id`, `state_id`, `updated_at`, `user_id`, `uuid`, `width`) VALUES ('2010-10-27 10:53:37', 0, 100, 'Sol Üst Köşe', 1, 5, '2010-10-27 10:53:37', 2, 'ad911e9f-020f-4722-a661-157f4b2eff65', 250)

  def edit
    @zone = Zone.find(params[:id])
---
SELECT `zones`.* FROM `zones` WHERE (`zones`.`id` = 1) LIMIT 1

  def update
    @zone = Zone.find(params[:id])
    if @zone.update_attributes(params[:zone])
---
SELECT `zones`.* FROM `zones` WHERE (`zones`.`id` = 1) LIMIT 1
UPDATE `zones` SET `height` = 250, `name` = 'Sol Üst Köşe', `updated_at` = '2010-10-26 10:10:33', `width` = 550 WHERE (`zones`.`id` = 1)