app/views/sites/_form.html.erb

SELECT `users`.* FROM `users` WHERE (state_id = 1)
---
        <li>
          <%= user_site.select :user_id, @users.map {|a| [a.info, a.id]}, :prompt => t('.choose_user'), :include_blank => true %>