app/views/sites/show.html.erb

    <td>
      <% if @site.zones.length > 0 %>
---
SELECT `zones`.* FROM `zones` WHERE (`zones`.site_id = 1)